def area(a, h):
    '''
    Возвращает площадь треугольника

        Параметры:
            a (float): длина одной из сторон треугольника \n
            h (float): длина высоты треугольника проведенная к стороне a

        Возвращаемое значение:
            s (float): площадь треугольника
    '''
    return a * h / 2
def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника

        Параметры:
            a (float): длина одной из сторон треугольника \n
            b (float): длина второй стороны треугольника \n
            c (float): длина третьей стороны треугольника
        Возвращаемое значение:
            p (float): периметр треугольника
    '''
    return a + b + c
